# shell
brew "fish"
brew "tmux"
brew "starship"
brew "gitui"
brew "autojump"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "exa"
brew "tree"
brew "glow"


# development
brew "node"
brew "pyenv"
brew "luarocks"
brew "lua-language-server"
brew "rust-analyzer"
brew "hashicorp/tap/terraform-ls"
brew "dnsmasq"
brew "mkcert"
brew "nss"
brew "rover"
brew "gopls"
brew "bufbuild/buf/buf"
brew "rbenv"

# latex
cask "skim"

# kubernetes
brew "minikube"
brew "kubectl"
brew "helmsman"
brew "terraform"
cask "kubecontext"
brew "fluxcd/tap/flux"
brew "kustomize"

# miscellaneous
cask "the-unarchiver"

# window tiling
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"

# neovim build dependencies
brew "ninja" 
brew "libtool" 
brew "automake" 
brew "cmake" 
brew "pkg-config" 
brew "gettext" 
brew "curl"
brew "gnu-sed"
